<template>
  <div class="helpful-info">
    <h2>{{ title }}</h2>

    <div class="helpful-info__content helpful-info__content_mt-20">
      <div v-html="content"/>
<!--      <p>-->
<!--        <a href="#">Перечень жизненно необходимых и важнейших лекарственных препаратов</a>-->
<!--        для медицинского применения-->
<!--      </p>-->
<!--      <p>-->
<!--        <a href="#">Перечень лекарственных препаратов</a>,-->
<!--        предназначенных для обеспечения лиц, больных гемофилией, муковисцидозом, гипофизарным нанизмом,-->
<!--        болезнью Гоше, злокачественными новообразованиями лимфоидной, кроветворной и родственных им тканей,-->
<!--        рассеянным склерозом, а также лиц после трансплантации органов и (или) тканей-->
<!--      </p>-->
<!--      <p>-->
<!--        <a href="#">Перечень лекарственных препаратов для медицинского применения</a>,-->
<!--        в том числе лекарственных препаратов для медицинского применения,-->
<!--        назначаемых по решению врачебных комиссий медицинских организаций-->
<!--      </p>-->
<!--      <p>-->
<!--        <a href="#">Перечень лекарственных препаратов</a>, отпускаемых населению в соответствии с-->
<!--        Перечнем групп населения и категорий заболеваний, при амбулаторном лечении которых лекарственные-->
<!--        средства и изделия медицинского назначения отпускаются по рецептам врачей бесплатно,-->
<!--        а также в соответствии с Перечнем групп населения, при амбулаторном лечении которых лекарственные-->
<!--        средства отпускаются по рецептам врачей с пятидесятипроцентной скидкой-->
<!--      </p>-->
    </div>
  </div>
</template>

<script>
export default {
  name: "HelpfulInfoText",
  props: ['title', 'content']
}
</script>

<style scoped lang="scss">
.helpful-info {
  margin-top: 30px;

  &__content {
    display: flex;
    flex-direction: column;
    row-gap: 40px;

    &_mt-20 {
      margin-top: 20px;
    }

    & > p {
      font-size: 15px;
      line-height: 25px;

      & > a {
        color: #FFA765;
        transition: .25s all ease;

        &:hover {
          color: #FF6100;
        }
      }
    }
  }
}
</style>