export default [
    {
        id: 1,
        title: 'Лечение наркомании',
        dropdown: [
            {
                id: 1,
                name: 'Реабилитация наркозависимых',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Реабилитация в стационаре',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Реабилитация амбулаторно',
                        path: ''
                    }
                ]
            },
            {
                id: 2,
                name: 'Лечение зависимости',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Лечение солевой зависимости',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Лечение спайсовой зависимости',
                        path: ''
                    },
                    {
                        id: 3,
                        name: 'Лечение наркозависимости у подростков',
                        path: ''
                    },
                    {
                        id: 4,
                        name: 'Лечение токсикомании',
                        path: ''
                    },
                    {
                        id: 5,
                        name: 'Лечение зависимости от мефедрона',
                        path: ''
                    },
                    {
                        id: 6,
                        name: 'Лечение от лирики',
                        path: ''
                    },
                    {
                        id: 7,
                        name: 'Лечение зависимости от марихуаны',
                        path: ''
                    },
                    {
                        id: 8,
                        name: 'Лечение зависимости от кокаина',
                        path: ''
                    },
                    {
                        id: 9,
                        name: 'Лечение зависимости от кодеина',
                        path: ''
                    },
                    {
                        id: 10,
                        name: 'Лечение зависимости от бутирата',
                        path: ''
                    },
                    {
                        id: 11,
                        name: 'Лечение зависимости от героина',
                        path: ''
                    },
                    {
                        id: 12,
                        name: 'Лечение амфетаминовой зависимости',
                        path: ''
                    },
                    {
                        id: 13,
                        name: 'Лечение метадоновой зависимости',
                        path: ''
                    },
                    {
                        id: 14,
                        name: 'Лечение зависимости от гашиша',
                        path: ''
                    },
                    {
                        id: 15,
                        name: 'Лечение зависимости от Альфа ПВП',
                        path: ''
                    },
                ]
            },
            {
                id: 3,
                name: 'Программы реабилитации',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Ресоциализация наркозависимых',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Курс лечения 28 дней',
                        path: ''
                    },
                    {
                        id: 3,
                        name: 'Программа 7Н',
                        path: ''
                    },
                    {
                        id: 4,
                        name: 'Программа 12 шагов',
                        path: ''
                    },
                    {
                        id: 5,
                        name: 'Программа Day Top',
                        path: ''
                    },
                    {
                        id: 6,
                        name: 'Метод Шичко',
                        path: ''
                    },
                    {
                        id: 7,
                        name: 'Терапия созависимости',
                        path: ''
                    },
                    {
                        id: 8,
                        name: 'Анонимная реабилитация',
                        path: ''
                    },
                ]
            },
            {
                id: 4,
                name: 'Бесплатно',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Бесплатное лечение наркозависимости',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Реабилитационный центр для наркозависимых бесплатно',
                        path: ''
                    },
                ]
            },
            {
                id: 5,
                name: 'Наркологические услуги',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Снятие ломки',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Детоксикация наркоманов',
                        path: ''
                    },
                    {
                        id: 3,
                        name: 'Ультрабыстрая опиоидная детоксикация',
                        path: ''
                    },
                    {
                        id: 4,
                        name: 'Кодирование от наркомании',
                        path: ''
                    },
                    {
                        id: 5,
                        name: 'По Довженко',
                        path: ''
                    },
                    {
                        id: 6,
                        name: 'Вшивание',
                        path: ''
                    },
                    {
                        id: 7,
                        name: 'Лазером',
                        path: ''
                    },
                    {
                        id: 8,
                        name: 'Сдача теста на наркотики',
                        path: ''
                    },
                    {
                        id: 9,
                        name: 'Консультация психотерапевта',
                        path: ''
                    },
                    {
                        id: 10,
                        name: 'Нарколог на дом',
                        path: ''
                    },
                    {
                        id: 11,
                        name: 'Капельница от наркотиков',
                        path: ''
                    },
                    {
                        id: 12,
                        name: 'Кодирование от курения',
                        path: ''
                    },
                    {
                        id: 13,
                        name: 'Наркологическая помощь',
                        path: ''
                    },
                    {
                        id: 14,
                        name: 'Помощь при передозировке',
                        path: ''
                    },
                    {
                        id: 15,
                        name: 'Принудительное лечение наркозависимости',
                        path: ''
                    },
                ]
            },
        ]
    },
    {
        id: 2,
        title: 'Лечение алкоголизма',
        dropdown: [
            {
                id: 1,
                name: 'Лечение алкоголизма в стационаре',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Нарколог на дом',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Консультация нарколога',
                        path: ''
                    },
                    {
                        id: 3,
                        name: 'Принудительное лечение алкоголизма',
                        path: ''
                    },
                    {
                        id: 4,
                        name: 'Медикаментозное лечение в стационаре',
                        path: ''
                    },
                ]
            },
            {
                id: 2,
                name: 'Программы реабилитации',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: '28 дней',
                        path: ''
                    },
                    {
                        id: 2,
                        name: '12 шагов',
                        path: ''
                    },
                    {
                        id: 3,
                        name: '7 навыков',
                        path: ''
                    },
                    {
                        id: 4,
                        name: 'DayTop',
                        path: ''
                    },
                    {
                        id: 5,
                        name: 'Метод Шичко',
                        path: ''
                    },
                ]
            },
            {
                id: 3,
                name: 'Вывод из запоя',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Капельница от запоя',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Капельница от похмелья',
                        path: ''
                    },
                    {
                        id: 3,
                        name: 'Частный вытрезвитель',
                        path: ''
                    },
                    {
                        id: 4,
                        name: 'В стационаре',
                        path: ''
                    },
                ]
            },
            {
                id: 4,
                name: 'Реабилитация алкоголиков',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Реабилитация в стационаре',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Амбулаторная реабилитация',
                        path: ''
                    },
                ]
            },
            {
                id: 5,
                name: 'Кодирование от алкоголя',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Подшивание от алкоголизма',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Вшивание ампулы',
                        path: ''
                    },
                    {
                        id: 3,
                        name: 'Кодирование гипнозом',
                        path: ''
                    },
                    {
                        id: 4,
                        name: 'Кодирование от алкоголя Двойной блок',
                        path: ''
                    },
                    {
                        id: 5,
                        name: 'Кодирование от алкоголя таблетками Эспераль',
                        path: ''
                    },
                    {
                        id: 6,
                        name: 'Кодирование от алкоголя таблетками Налтрексон',
                        path: ''
                    },
                    {
                        id: 7,
                        name: 'Кодирование от алкоголя таблетками Аквилонг',
                        path: ''
                    },
                    {
                        id: 8,
                        name: 'Кодирование от алкоголизма таблетками Вивитрол',
                        path: ''
                    },
                    {
                        id: 9,
                        name: 'Кодирование от алкоголизма по методу Довженко',
                        path: ''
                    },
                    {
                        id: 10,
                        name: 'Снятие кодировки',
                        path: ''
                    },
                    {
                        id: 11,
                        name: 'Справка о кодировке',
                        path: ''
                    },
                    {
                        id: 12,
                        name: 'Кодирование уколом',
                        path: ''
                    },
                    {
                        id: 13,
                        name: 'Кодирование на дому',
                        path: ''
                    },
                    {
                        id: 14,
                        name: 'Психологическое кодирование',
                        path: ''
                    },
                    {
                        id: 15,
                        name: 'Метод Довженко',
                        path: ''
                    },
                    {
                        id: 16,
                        name: 'Метод Торпедо',
                        path: ''
                    },
                ]
            },
            {
                id: 6,
                name: 'Прочие виды лечения алкоголизма',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Лечение абстинентного синдрома',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Раскодирование от алкоголизма',
                        path: ''
                    },
                    {
                        id: 3,
                        name: 'Психологическое кодирование',
                        path: ''
                    },
                    {
                        id: 4,
                        name: 'Лечение подросткового алкоголизма',
                        path: ''
                    },
                    {
                        id: 5,
                        name: 'Лечение женского алкоголизма',
                        path: ''
                    },
                    {
                        id: 6,
                        name: 'Бесплатное лечение',
                        path: ''
                    },
                    {
                        id: 7,
                        name: 'Помощь алкоголикам',
                        path: ''
                    },
                    {
                        id: 8,
                        name: 'Хронический алкоголизм',
                        path: ''
                    },
                    {
                        id: 9,
                        name: 'Лечение иглоукалыванием',
                        path: ''
                    },
                    {
                        id: 10,
                        name: 'Пивной алкоголизм',
                        path: ''
                    },
                    {
                        id: 11,
                        name: 'Анонимное лечение',
                        path: ''
                    },
                    {
                        id: 12,
                        name: 'Лечение гипнозом',
                        path: ''
                    },
                    {
                        id: 13,
                        name: 'Лечение лазером',
                        path: ''
                    },
                    {
                        id: 14,
                        name: 'Детоксикация',
                        path: ''
                    },
                ]
            },
        ]
    },
    {
        id: 3,
        title: 'Другие зависимости',
        dropdown: [
            {
                id: 1,
                name: 'Лечение булимии',
                path: ''
            },
            {
                id: 2,
                name: 'Лечение анорексии',
                path: ''
            },
            {
                id: 3,
                name: 'Лечение игромании',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Лечение игромании гипнозом',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Лечение интернет-зависимости',
                        path: ''
                    },
                    {
                        id: 3,
                        name: 'Лечение зависимости от компьютерных игр',
                        path: ''
                    },
                    {
                        id: 4,
                        name: 'Лечение лудомании (ставки на спорт)',
                        path: ''
                    },
                    {
                        id: 5,
                        name: 'Лечение зависимости от социальных сетей',
                        path: ''
                    },
                    {
                        id: 6,
                        name: 'Лечение интернет-зависимости у подростков',
                        path: ''
                    },
                ]
            },
            {
                id: 2,
                name: 'Прочие услуги',
                path: '',

                dropdown: [
                    {
                        id: 1,
                        name: 'Лечебная реабилитация',
                        path: ''
                    },
                    {
                        id: 2,
                        name: 'Лечебная реабилитация',
                        path: ''
                    },
                    {
                        id: 3,
                        name: 'Лечебная реабилитация',
                        path: ''
                    },
                    {
                        id: 4,
                        name: 'Лечебная реабилитация',
                        path: ''
                    },
                    {
                        id: 5,
                        name: 'Лечебная реабилитация',
                        path: ''
                    },
                ]
            },
        ]
    },
    {
        id: 4,
        title: 'О клинике',
        dropdown: [
            {
                id: 1,
                name: 'История клиники',
                path: '/history'
            },
            {
                id: 2,
                name: 'Специалисты',
                path: '/specialists'
            },
            {
                id: 3,
                name: 'Сертификаты и лицензии',
                path: '/certificates'
            },
            {
                id: 4,
                name: 'Цены',
                path: '/price'
            },
            {
                id: 5,
                name: 'Отзывы',
                path: '/reviews'
            },
            {
                id: 6,
                name: 'Фото',
                path: '/photo'
            },
            {
                id: 7,
                name: 'Статьи',
                path: '/blog'
            },
            {
                id: 8,
                name: 'СМИ о нас',
                path: '/media'
            },
            {
                id: 9,
                name: 'Акции',
                path: '/stock'
            },
            {
                id: 10,
                name: 'Видео лекции',
                path: '/video-lectures'
            },
            {
                id: 11,
                name: 'Контролирующие органы',
                path: '/regulatory-bodies'
            },
            {
                id: 12,
                name: 'Полезная информация',
                path: '/helpful-info'
            },
            {
                id: 13,
                name: 'Контакты',
                path: '/contacts'
            },
            {
                id: 14,
                name: 'Политика конфиденциальности',
                path: '/policy'
            },
            {
                id: 15,
                name: 'Пользовательское соглашение',
                path: '/terms'
            },
        ]
    },
]